WildernessLabs/Meadow/configs/stm32f777zit6-meadow/src/hcom_nx/hcom_nx_config_manager.c
    if (buffer_length > 16)
    {
        result = snprintf((char *) buffer, buffer_length, "%d.%d.%d.%d", (config->mono_version >> 24) & 0xff, (config->mono_version >> 16) & 0xff,
                            (config->mono_version >> 8) & 0xff, config->mono_version & 0xff);
    }
    else
    {
        result = ERROR;
    }

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_set_config_value
 *
 * Description:
 *  Read or write a configuration value.
 *
 * Input Parameters:
 *  item - Value to be accessed.
 *  direction - Read (0) or write (1).
 *  buffer - Buffer to hold the value when reading, or holding the new value
 *           when writing.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
int hcom_nx_config_get_set_config_value(int item, uint8_t direction, uint8_t *buffer, int buffer_length)
{
    int result;

    hcom_nx_config_lock();
    meadow_configuration_t *config = hcom_nx_get_configuration();
    switch (item)
    {
        case cv_device_name:
            result = hcom_nx_config_get_string_value(config->device_name, buffer, buffer_length);
            break;
        case cv_product:
            result = hcom_nx_config_get_string_value(config->meadow_hardware_version, buffer, buffer_length);
            break;
        case cv_model:
            result = hcom_nx_config_get_string_value(HCOM_DEVICE_INFO_MODEL, buffer, buffer_length);
            break;
        case cv_os_version:
            result = hcom_nx_config_get_string_value(config->meadow_software_version, buffer, buffer_length);
            break;
        case cv_build_date:
            result = hcom_nx_config_get_string_value(__DATE__ " " __TIME__, buffer, buffer_length);
            break;
        case cv_processor_type:
            result = hcom_nx_config_get_string_value(HCOM_DEVICE_INFO_PROCESSOR_TYPE, buffer, buffer_length);
            break;
        case cv_unique_id:
            result = hcom_nx_config_get_unique_id(config, buffer, buffer_length);
            break;
        case cv_serial_number:
            result = hcom_nx_config_get_serial_number(config, buffer, buffer_length);
            break;
        case cv_coprocessor_type:
            result = hcom_nx_config_get_string_value(HCOM_DEVICE_INFO_COPROCESSOR_TYPE, buffer, buffer_length);
            break;
        case cv_coprocessor_firmware_version:
            result = hcom_nx_config_get_coprocessor_firmware_version(config, buffer, buffer_length);
            break;
        case cv_mono_version:
            result = hcom_nx_config_get_mono_version(config, buffer, buffer_length);
            break;
        case cv_automatically_start_network:
            result = ERROR;
            break;
        case cv_automatically_reconnect:
            result = ERROR;
            break;
        case cv_maximum_network_retry_count:
            result = ERROR;
            break;
        case cv_get_time_at_startup:
            result = ERROR;
            break;
        case cv_ntp_server:
            result = ERROR;
            break;
        case cv_mac_address:
            result = ERROR;
            break;
        case cv_soft_ap_mac_address:
            result = ERROR;
            break;
        default:
            result = ERROR;
            break;
    }
    hcom_nx_config_unlock();
    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_init
 *
 * Description:
 *  Setup the configuration system and populate the configuration structure
 *  with data from the configuration file.
 *
 * Input Parameters:
 *  None.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_config_init(void)
{
    sem_init(&config_lock, 0, 1);                   // Create the config lock.
    sem_setprotocol(&config_lock, SEM_PRIO_NONE);
    hcom_nx_read_configuration_file();

    uint32_t mono_version = 0;

    boardctl(BIOC_ENTER_MEMMAP, 0);

    // Check if Meadow.OS runtime is flashed at external flash.
    #define STM32_FMCBANK4_BASE  0x90000000     /* 0x90000000-0x9fffffff: FMC bank 4 */
    uint32_t signature = *((uint32_t *) STM32_FMCBANK4_BASE);
    if (signature != 0xDDCCBBAA)
    {
        syslog(LOG_ERR, "Mono runtime was not found flashed in external flash.\n");
    }
    else
    {
        mono_version = *((uint32_t *) (STM32_FMCBANK4_BASE + 4));
    }
    boardctl(BIOC_EXIT_MEMMAP, 0);

    hcom_nx_config_lock();
    meadow_configuration_t *config = hcom_nx_get_configuration();
    config->mono_version = mono_version;
    config->meadow_software_version = HCOM_DEVICE_INFO_MEADOW_OS_VERSION;
    config->meadow_hardware_version = meadow_hw_version_string_return();

    stm32_get_uniqueid(config->serial_number);                           // Convert chip Id to serial number
    config->chip_id[0] = config->serial_number[11];                      // 95-88
    config->chip_id[1] = config->serial_number[10] + config->serial_number[2];        // 87-80 + 23-16
    config->chip_id[2] = config->serial_number[9];                       // 79-72
    config->chip_id[3] = config->serial_number[8] + config->serial_number[0] + 10;    // 71-64 + 7-0 + magic 10
    config->chip_id[4] = config->serial_number[7];                       // 63-56 
    config->chip_id[5] = config->serial_number[6];                       // 55-48

    hcom_nx_config_unlock();
}
